# Data Set used : Titanic
---
- survival - Survival (0 = No; 1 = Yes)
- class - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
- name - Name
- sex - Sex
- age - Age
- sibsp - Number of Siblings/Spouses Aboard
- parch - Number of Parents/Children Aboard
- ticket - Ticket Number
- fare - Passenger Fare
- cabin - Cabin
- embarked - Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)
- boat - Lifeboat (if survived)
- body - Body number (if did not survive and body was recovered)

# Pandas Tutorial

In [6]:
import pandas as pd 
import numpy as np
import os
import time as T

import ipywidgets.widgets as wgts

In [13]:
#generating the list for csv files only
list_of_csv_files = [i for i in os.listdir(os.path.curdir) if i.split('.')[1] == 'csv']

In [39]:
dd = wgts.Dropdown(
    options = list_of_csv_files,
    value = list_of_csv_files[len(list_of_csv_files)-1],
    #description = 'CSV Files: '
)

# Select a dataset from Dropdown

In [40]:
Lable_for_DropDown = wgts.Label("Select The Dataset File: ")
Hbox_1 = wgts.HBox([
    Lable_for_DropDown,
    dd
])
display(Hbox_1)

HBox(children=(Label(value='Select The Dataset File: '), Dropdown(index=2, options=('gender_submission.csv', '…

## Open the selected Dataset

In [48]:
filename = dd.value
titanic_pd = pd.read_csv(filename)
print(filename)

train.csv

In [49]:
file_pd.head(5)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Print the data types of each col
---

In [50]:
display(titanic_pd.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

# Pandas Dataframe info() function

In [53]:
type_of_titanic_pd = titanic_pd.info()
print(f"\n{type(type_of_titanic_pd)}")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

<class 'NoneType'>

# How do I select a subset of a DataFrame?

In [149]:
lbl2 = wgts.Label("Select Column Name : ")
dd_2 = wgts.SelectMultiple(
    options = titanic_pd.columns,
    value = [titanic_pd.columns[0]],
)
Vbox = wgts.VBox([lbl2,dd_2])

In [166]:
def showTable(selectedCol,no_of_row=10):
    #print(type(selectedCol))
    #print(k)
    display(titanic_pd[list(selectedCol)][:no_of_row])

no = wgts.IntSlider(
    min = 1,
    max = 15,
    steps = 1,
    description = 'No of Rows: '
)
out = wgts.interactive_output(
    showTable,
    {'selectedCol':dd_2,'no_of_row':no}
)
#display(titanic_pd[list(dd_2.value)][:10])
wgts.HBox([wgts.VBox([Vbox,no]), out])

HBox(children=(VBox(children=(VBox(children=(Label(value='Select Column Name : '), SelectMultiple(index=(1, 2,…

### Above Visualization can be done in another way: Given Below
---

[Document](https://ipywidgets.readthedocs.io/en/stable/examples/Layout%20Templates.html)

In [167]:
from ipywidgets import TwoByTwoLayout

TwoByTwoLayout(top_left=Vbox,
               top_right=out,
               bottom_left=no)

TwoByTwoLayout(children=(VBox(children=(Label(value='Select Column Name : '), SelectMultiple(index=(1, 2, 3, 4…

## I’m interested in the passengers older than 35 years.

---

In [177]:
k = titanic_pd['Age'] > 35
print(k[:9])

0    False
1     True
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: Age, dtype: bool

### The output of the conditional expression (>, but also ==, !=, <, <=,… would work) is actually a pandas Series of boolean values (either True or False) with the same number of rows as the original DataFrame. Such a Series of boolean values can be used to filter the DataFrame by putting it in between the selection brackets []. Only rows for which the value is True will be selected.

In [172]:
titanic_pd[titanic_pd['Age'] > 35] #.shape

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
865,866,1,2,"Bystrom, Mrs. (Karolina)",female,42.0,0,0,236852,13.0000,NaN,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q

## Unique Value of a col

In [209]:
sex_dd_list = titanic_pd["Sex"].unique()
#DropDown to choose a particular sex
#print(sex_dd_list.shape)
sex_dd = wgts.Dropdown(
    options = sex_dd_list,
    value = sex_dd_list[0],
    description = "Sex: "
)

def count_uniqueSex(sex):
    global titanic_pd
    l= titanic_pd['Sex']==sex
    print(f"No of {sex}: {len([i for i in l if i == True])}")

    
OutCount = wgts.interactive_output(count_uniqueSex,{'sex':sex_dd})
viz_count=(wgts.HBox(
    [
        sex_dd,
        OutCount
    ]
))
display(viz_count)

HBox(children=(Dropdown(description='Sex: ', options=('male', 'female'), value='male'), Output()))

In [211]:
titanic_pd.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [332]:
col_for_unq_val = ['Survived','Pclass','Sex','Cabin','Embarked']

lbl_Col_dd = wgts.Label("Choose A Column")

Col_DropDown = wgts.Dropdown(
    options = col_for_unq_val,
    #value = 'Sex'
)

Vbox_1 = wgts.VBox([lbl_Col_dd,Col_DropDown])
#unique_dd = 1
display(Vbox_1)


def counts_unq_elements(unq_val_ele):
    global titanic_pd
    global Col_DropDown
    print(unq_val_ele)
    l = titanic_pd[Col_DropDown.value] == unq_val_ele
    print(f"\nNo of {unq_val_ele}: {len([i for i in l if i == True])}")


def set_2nd_DropDown(col_name):
    global titanic_pd
    col_unqs = titanic_pd[col_name].unique() #Col_DropDown.value
    #print(col_unqs)
    lbl_Unq_Val = wgts.Label("Choose Unique Value: ")
    select_unq_dd = wgts.Dropdown(
        options = col_unqs,
        value = col_unqs[1]
    )
    Vbox_2 = wgts.VBox([lbl_Unq_Val,select_unq_dd])
    display(Vbox_2)
    OutCount = wgts.interactive_output(counts_unq_elements,{'unq_val_ele':select_unq_dd})
    display(OutCount)
    

Sec_DD = wgts.interactive_output(set_2nd_DropDown,{'col_name':Col_DropDown})
#type(Sec_DD)
display(Sec_DD)

VBox(children=(Label(value='Choose A Column'), Dropdown(options=('Survived', 'Pclass', 'Sex', 'Cabin', 'Embark…

Output()